app/controllers/movies_controller.rb

SELECT * FROM "movies"
---
  def index
    @movies = Movie.all

SELECT * FROM "movies" WHERE ("movies"."id" = 10)
---
  def show
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("rating", "created_at", "title", "released_on", "updated_at", "description", "score") VALUES('R', '2010-10-19 05:01:07', 'The Matrix Revolutions', '2003-10-27 08:00:00', '2010-10-19 05:01:07', 'In the third installment, the epic war between man and machine reaches a thundering crescendo: the Zion military, aided by courageous civilian volunteers like Zee and the Kid, desperately battles to hold back the Sentinel invasion as the Machine army bores into their stronghold. Facing total annihilation, the citizens of the last bastion of humanity fight not only for their own lives but future...', 7)
---
  def add
    respond_to do |format|
      if params[:movieChoice]
        @movie = Movie.new
        modifiedTitle = "title" + params[:movieChoice]
        modifiedDescription = "description" + params[:movieChoice]
        modifiedScore = "score" + params[:movieChoice]
        modifiedRating = "rating" + params[:movieChoice]
        modifiedReleased = "released_on" + params[:movieChoice]
        @movie.title = params[modifiedTitle]
        @movie.description = params[modifiedDescription]
        @movie.score = params[modifiedScore]
        @movie.rating = params[modifiedRating]
        @movie.released_on = params[modifiedReleased]
        if @movie.save

INSERT INTO "movies" ("rating", "created_at", "title", "released_on", "updated_at", "description", "score") VALUES('G', '2010-10-16 01:21:21', 'new movie ', '2010-07-16 00:00:00', '2010-10-16 01:21:21', 'ajsfdljasldfkj', 0)
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT * FROM "movies" WHERE ("movies"."id" = 2)
DELETE FROM "movies" WHERE "id" = 2
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy